# 07数据清洗与准备

In [2]:
import pandas as pd
import numpy as np

## 1.处理缺失值

In [3]:
string_data = pd.Series(['a', 'b', np.nan, 'c'])

In [4]:
string_data

0      a
1      b
2    NaN
3      c
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 1.1过滤缺失值

In [9]:
from numpy import  nan as NA

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
#等价
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA],
                    [NA, NA, NA],[NA, 6.5, 3]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [19]:
#删除所有值均为NA的行
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7,3))

In [25]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA

In [26]:
df

          0         1         2
0 -0.447784       NaN       NaN
1 -0.754894       NaN       NaN
2 -0.358562       NaN  0.747897
3 -1.568238       NaN -0.788996
4 -0.294556  0.284121  0.354263
5  0.698969 -0.516532 -1.136236
6  0.387456  1.142656  0.989464

In [27]:
df.dropna()

          0         1         2
4 -0.294556  0.284121  0.354263
5  0.698969 -0.516532 -1.136236
6  0.387456  1.142656  0.989464

In [28]:
df.dropna(thresh = 2)

          0         1         2
2 -0.358562       NaN  0.747897
3 -1.568238       NaN -0.788996
4 -0.294556  0.284121  0.354263
5  0.698969 -0.516532 -1.136236
6  0.387456  1.142656  0.989464

### 1.2补全缺失值

In [30]:
df.fillna(0)

          0         1         2
0 -0.447784  0.000000  0.000000
1 -0.754894  0.000000  0.000000
2 -0.358562  0.000000  0.747897
3 -1.568238  0.000000 -0.788996
4 -0.294556  0.284121  0.354263
5  0.698969 -0.516532 -1.136236
6  0.387456  1.142656  0.989464

In [32]:
#可以为不同列设定不同的填充值
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.447784  0.500000  0.000000
1 -0.754894  0.500000  0.000000
2 -0.358562  0.500000  0.747897
3 -1.568238  0.500000 -0.788996
4 -0.294556  0.284121  0.354263
5  0.698969 -0.516532 -1.136236
6  0.387456  1.142656  0.989464

In [35]:
#fillna返回的是一个新对象，但也可以修改已经存在的对象
_ = df.fillna(0, inplace =True)

In [36]:
df

          0         1         2
0 -0.447784  0.000000  0.000000
1 -0.754894  0.000000  0.000000
2 -0.358562  0.000000  0.747897
3 -1.568238  0.000000 -0.788996
4 -0.294556  0.284121  0.354263
5  0.698969 -0.516532 -1.136236
6  0.387456  1.142656  0.989464

In [37]:
df = pd.DataFrame(np.random.randn(6,3))

In [38]:
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA

In [39]:
df

          0         1         2
0  2.065697 -0.886700 -0.921789
1 -0.066717  0.714967  0.535215
2  0.057039       NaN  0.347084
3  1.269731       NaN  0.581695
4 -1.822396       NaN       NaN
5  0.976175       NaN       NaN

In [40]:
df.fillna(method = 'ffill')

          0         1         2
0  2.065697 -0.886700 -0.921789
1 -0.066717  0.714967  0.535215
2  0.057039  0.714967  0.347084
3  1.269731  0.714967  0.581695
4 -1.822396  0.714967  0.581695
5  0.976175  0.714967  0.581695

In [41]:
#limit用于前向或后向填充时最大的填充范围
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0  2.065697 -0.886700 -0.921789
1 -0.066717  0.714967  0.535215
2  0.057039  0.714967  0.347084
3  1.269731  0.714967  0.581695
4 -1.822396       NaN  0.581695
5  0.976175       NaN  0.581695

In [42]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [43]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 2.数据转换

### 2.1删除重复值

In [48]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                 'k2': [1,1,2,3,3,4,4]})

In [49]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [50]:
#反映每一行是否存在重复情况
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [51]:
#返回数组中为False的部分
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [52]:
#基于特定列去除重复值
data['v1'] = range(7)

In [53]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [54]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [55]:
#duplicated和drop_duplicates默认都是保留第一个观测到的值
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [56]:
data.drop_duplicates(['k1'], keep = 'last')

    k1  k2  v1
4  one   3   4
6  two   4   6

### 2.2使用函数或映射进行数据转换

In [58]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [59]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [68]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [69]:
lowercased = data['food'].str.lower()

In [70]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [71]:
data['animal'] = lowercased.map(meat_to_animal)

In [72]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [73]:
#等价
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 2.3替代值

In [74]:
data = pd.Series([1, -999, 2, -999, -1000, 3])

In [75]:
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [76]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [77]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [78]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [81]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 2.4重命名轴索引

In [82]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])

In [83]:
transform = lambda x: x[:4].upper()

In [84]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [85]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [86]:
#创建数据集转换后的版本，并且不修改原有的数据集
data.rename(index = str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [90]:
#为轴标签提供新的值
data.rename(index = {'Ohio': 'INDIANA'},
            columns = {'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [91]:
#修改原有的数据集
data.rename(index = {'Ohio': 'INDIANA'}, inplace =True)

In [92]:
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

### 2.5离散化和分箱

In [93]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [94]:
bins = [18, 25, 35, 60, 100]

In [95]:
cats = pd.cut(ages, bins)

In [96]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [97]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [98]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [99]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

### 2.6检测和过滤异常值

In [100]:
data = pd.DataFrame(np.random.randn(1000,4))

In [101]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007841    -0.023768    -0.025046    -0.005062
std       1.009614     0.994293     1.015246     1.008670
min      -3.594767    -3.453465    -3.072815    -2.946849
25%      -0.692786    -0.719063    -0.725988    -0.680080
50%       0.034151    -0.034095    -0.022945    -0.009195
75%       0.655173     0.625860     0.687911     0.676099
max       2.784529     3.275145     2.911312     3.126414

In [102]:
col = data[2]

In [103]:
col[np.abs(col) > 3]

168   -3.072815
Name: 2, dtype: float64

In [104]:
#选出大于3或小于-3的行
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
69   0.703574  3.047306  1.632116 -1.941616
105 -3.086689  2.283764  0.078415 -1.068627
122  0.301190 -3.453465 -1.559587  0.265925
159 -3.175263 -1.269740  0.738754 -0.004720
168  0.123139 -0.355754 -3.072815  1.383740
296  0.908930 -0.005276 -0.071120  3.047044
311 -3.594767  0.275417  1.244531 -0.323402
322  0.646936  3.275145 -1.000968  0.319162
338 -1.265866 -3.106727 -1.190375  0.002423
611 -1.229515  2.030461  0.829541  3.082911
719 -0.922866  2.342168  0.572766  3.126414

In [105]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [106]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.006984    -0.023530    -0.024973    -0.005318
std       1.006874     0.991480     1.015029     1.007893
min      -3.000000    -3.000000    -3.000000    -2.946849
25%      -0.692786    -0.719063    -0.725988    -0.680080
50%       0.034151    -0.034095    -0.022945    -0.009195
75%       0.655173     0.625860     0.687911     0.676099
max       2.784529     3.000000     2.911312     3.000000

In [107]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0
3 -1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0  1.0

### 2.7置换和随机抽样

In [108]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [109]:
sampler = np.random.permutation(5)

In [110]:
sampler

array([1, 4, 3, 2, 0])

In [111]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [112]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

### 2.8计算指标/虚拟变量

In [113]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1': range(6)})

In [114]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [115]:
dummies = pd.get_dummies(df['key'], prefix = 'key')

In [116]:
df_with_dummy = df[['data1']].join(dummies)

In [117]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## 3.字符串操作

### 3.1字符串对象方法

In [118]:
val = 'a,b,  guido'

In [119]:
val.split(',')

['a', 'b', '  guido']

In [120]:
pieces = [x.strip() for x in val.split(',')]

In [121]:
pieces

['a', 'b', 'guido']

In [122]:
'::'.join(pieces)

'a::b::guido'

### 3.2正则表达式

In [123]:
import re

In [124]:
text = "too   bar\t baz    \tqux"

In [125]:
re.split('\s+', text)

['too', 'bar', 'baz', 'qux']

In [126]:
regex = re.compile('\s+')

In [127]:
regex.split(text)

['too', 'bar', 'baz', 'qux']

In [128]:
regex.findall(text)

['   ', '\t ', '    \t']

### 3.3pandas中的向量化字符串函数

In [133]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
         'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [135]:
data = pd.Series(data)

In [136]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [138]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [139]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [140]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [141]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [142]:
matches = data.str.match(pattern, flags = re.IGNORECASE)

In [143]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [144]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [145]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [146]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object